app/views/admin/items/edit.html.erb

SELECT "genres".* FROM "genres"
---
        <label>ジャンル</label>
        <%= f.collection_select( :genre_id, Genre.all, :id, :name) %><br>