app/views/admin/items/new.html.erb

SELECT "genres".* FROM "genres"
---
    <h3>ジャンル</h3>
    <%= f.collection_select( :genre_id, Genre.all, :id, :name) %>