app/controllers/admin/customers_controller.rb

  def update
      @customer = Customer.find(params[:id])
    if @customer.update(customer_params)
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "customers" SET "is_active" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["is_active", 1], ["updated_at", "2022-05-04 11:32:52.619832"], ["id", 1]]