app/controllers/admin/genres_controller.rb

INSERT INTO "genres" ("created_at", "updated_at", "name") VALUES (?, ?, ?)  [["created_at", "2022-04-30 04:39:43.200648"], ["updated_at", "2022-04-30 04:39:43.200648"], ["name", "モンブラン"]]
---
  def create
    @genres = Genre.all
    @genre = Genre.new(genre_params)
    if @genre.save