app/controllers/admin/items_controller.rb

UPDATE "items" SET "updated_at" = ? WHERE "items"."id" = ?  [["updated_at", "2022-04-30 04:40:43.888251"], ["id", 1]]
---
  def update
    @item = Item.find(params[:id])
    if @item.update(item_params)

INSERT INTO "items" ("genre_id", "name", "introduction", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["genre_id", 1], ["name", "テストモンブラン"], ["introduction", "test"], ["price", 660], ["created_at", "2022-04-30 04:40:43.790691"], ["updated_at", "2022-04-30 04:40:43.790691"]]
---
  def create
    @item = Item.new(item_params)
    @items = Item.all
    if @item.save