app/views/admin/homes/top.html.erb

            <td><% @sum = 0 %>
                <% order.order_details.each do |order_details| %>
---
SELECT "orders".* FROM "orders"
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]