app/controllers/public/addresses_controller.rb

  def create
    @address = current_customer.addresses.new(address_params)
    @address.save
---
INSERT INTO "addresses" ("created_at", "updated_at", "name", "postal_code", "address", "customer_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2022-04-30 03:30:34.441350"], ["updated_at", "2022-04-30 03:30:34.441350"], ["name", "a"], ["postal_code", "0000000"], ["address", "sa"], ["customer_id", 1]]

  def destroy
    @address = Address.find(params[:id])
    if @address.destroy
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "addresses" WHERE "addresses"."id" = ?  [["id", 1]]