app/controllers/public/cart_items_controller.rb

  def update
    @cart_item = CartItem.find(params[:id])
    @cart_item.customer = current_customer
    if @cart_item.update(cart_item_params)
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cart_items" SET "updated_at" = ?, "amount" = ? WHERE "cart_items"."id" = ?  [["updated_at", "2022-04-30 05:37:59.519444"], ["amount", 3], ["id", 8]]

  def destroy
    @cart_item = CartItem.find(params[:id])
    @cart_item.customer = current_customer
    if @cart_item.destroy
      redirect_to public_cart_items_path
    else
      @cart_items = CartItem.all
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 15]]
SELECT "cart_items".* FROM "cart_items"

  def all_delete
    CartItem.destroy_all
---
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 16]]

  def create
    if current_customer
      @cart_itema = CartItem.find_by(item_id: cart_item_params[:item_id], customer_id: current_customer.id)
      if @cart_itema
        amount = @cart_itema.amount + cart_item_params[:amount].to_i
        @cart_itema.update(amount: amount)
        redirect_to public_cart_items_path
      else
        @cart_item = CartItem.new(cart_item_params)
        @cart_item.customer = current_customer
          if @cart_item.save
            redirect_to public_cart_items_path
          else
            @cart_items = CartItem.all
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."item_id" = ? AND "cart_items"."customer_id" = ? LIMIT ?  [["item_id", 3], ["customer_id", 2], ["LIMIT", 1]]
UPDATE "cart_items" SET "updated_at" = ?, "amount" = ? WHERE "cart_items"."id" = ?  [["updated_at", "2022-05-04 09:33:47.534628"], ["amount", 2], ["id", 19]]
INSERT INTO "cart_items" ("created_at", "updated_at", "amount", "item_id", "customer_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2022-05-04 08:54:57.302455"], ["updated_at", "2022-05-04 08:54:57.302455"], ["amount", 1], ["item_id", 3], ["customer_id", 2]]
SELECT "cart_items".* FROM "cart_items"