app/controllers/public/customers_controller.rb

UPDATE "customers" SET "last_name" = ?, "last_name_kana" = ?, "first_name" = ?, "first_name_kana" = ?, "postal_code" = ?, "address" = ?, "telephone_number" = ?, "email" = ?, "updated_at" = ? WHERE "customers"."id" = ?
---
  def update
    @customer = current_customer
    if @customer.update(customer_params)

UPDATE "customers" SET "is_active" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["is_active", 0], ["updated_at", "2022-05-04 10:10:38.904849"], ["id", 1]]
---
  def unsubscribe
    @customer = current_customer

    @customer.update(is_active: false)