app/controllers/public/orders_controller.rb

  def new
    if current_customer.cart_items.present?
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 2]]

  def create
    @order = Order.new(order_params)
    @cart_items = CartItem.where(customer_id: current_customer.id)
    if @order.save
      @cart_items.each do |cart_item|
        @order_detail = OrderDetail.new
        @order_detail.item_id = cart_item.item_id
        @order_detail.amount = cart_item.amount
        @order_detail.order_id = @order.id
        @order_detail.total_price = cart_item.item.price
        @order_detail.save
      end
      flash[:notice] = "successfuly"
      CartItem.destroy_all
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
INSERT INTO "orders" ("customer_id", "zip_code", "address", "name", "total_payment", "status", "postage", "payment_method", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 2]]
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items"
INSERT INTO "order_details" ("order_id", "item_id", "total_price", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["order_id", 14], ["item_id", 1], ["total_price", 660], ["amount", 2], ["created_at", "2022-05-04 09:35:02.907001"], ["updated_at", "2022-05-04 09:35:02.907001"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 19]]

  def confirm
    # @order = current_customer.orders.new
    @order = Order.new(order_params)
    @order.customer_id = current_customer.id
    @order.postage = 800
    @cart_items = CartItem.all
    @total = 0
    @order.status = 0
    if params[:order][:addressa] == "0"
      @order.zip_code = current_customer.postal_code
      @order.address = current_customer.address
      @order.name = current_customer.first_name + current_customer.last_name
    elsif params[:order][:addressa] == "1"
      @address = Address.find(params[:order][:address_id])
---
SELECT "cart_items".* FROM "cart_items"
SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]