app/views/public/orders/index.html.erb

SELECT "items".* FROM "items" INNER JOIN "order_details" ON "items"."id" = "order_details"."item_id" WHERE "order_details"."order_id" = ?  [["order_id", 1]]
---
            <td>〒<%= order.zip_code %><br><%= order.address + order.name %></td>
            <td><% order.items.each do |item| %>