app/views/public/orders/new.html.erb

SELECT "addresses".* FROM "addresses"
---
              <%= f.label :address, "登録先住所から選択" %>
              <%= f.select :address_id, options_from_collection_for_select(Address.all, :id, :address_display) %>